from .credintials import BOT_USERNAME, SUPPORT_EMAIL, SUPPORT_USERNAME, PLATFORM_FARSI

start = """👋 سلام *{}*!

🔋 به  *🏋️فیتبات🏋️* خوش اومدی!

🔭 به کمک فیتبات میتونی بدنت رو بسازی و سالم بمونی!
🍔 محاسبه شاخص توده بدن یا BMI
❤️‍🔥 محاسبه متابولیسم یا BMR

💿 برای ادامه، فیتبات نیاز به یک سری اطلاعات فیزیکی شما داره، اول با جنسیتت شروع کن:‌"""

male = "👨 مرد"
female = "👩 زن"

confirm_gender = """✅ شما *{}* هستید.

⏳ لطفا سن خود را به صورت عدد وارد کنید:"""

confirm_age = """✅ شما *{}* ساله هستید.

⏳ لطفا قد خود را به سانتی‌متر وارد کنید:"""

confirm_height = """✅ شما *{} سانت* هستید.

⏳ لطفا وزن خود را به کیلوگرم وارد کنید:"""

confirm_weight = """✅ شما *{}* کیلو* هستید."""

update = """✅ شما تقاضای *آپدیت اطلاعات* خود را کرده‌اید.

💿 اول با جنسیت شروع کن:"""

unknown = """🥲 متاسفانه متوجه پیامت نشدم. لطفا از منو یک گزینه رو انتخاب کن یا از کامند /help کمک بگیر."""

bmi = """🍔 **شاخص توده بدنی (BMI)** شما *{:.5f}* است.

{}

با فیتبات، فیت بمون 💪
""" + BOT_USERNAME

class BMIRanges():
    under_weight = """⚠️ **کمبود وزن** (BMI < 18.5)  
   🟢 وزن شما کمتر از حد نرمال است.  
   توصیه می‌شود که با یک متخصص تغذیه مشورت کنید و رژیم غذایی متعادل و کافی داشته باشید تا به وزن سالم برسید.  
   📈 **افزایش وزن** را در نظر بگیرید!"""

    normal = """✅ **وزن نرمال** (18.5 ≤ BMI < 24.9)  
   🟢 وزن شما در محدوده سالم است.  
   به زندگی سالم ادامه دهید و به رژیم غذایی و فعالیت بدنی خود توجه داشته باشید.  
   💪 **ادامه دهید** و به سلامت خود اهمیت دهید!"""

    over_weight = """⚠️ **اضافه وزن** (25 ≤ BMI < 29.9)  
   🟡 وزن شما بیشتر از حد نرمال است.  
   برای بهبود وضعیت خود، پیشنهاد می‌شود که فعالیت بدنی بیشتری داشته باشید و رژیم غذایی متعادل‌تری را دنبال کنید.  
   🏃‍♂️ **فعال‌تر شوید** و به رژیم غذایی خود توجه کنید!"""

    fat = """🚨 **چاقی** (BMI ≥ 30)  
   🔴 وزن شما در محدوده چاقی قرار دارد.  
   توصیه می‌شود که با یک پزشک یا متخصص تغذیه مشورت کنید و تغییرات لازم در رژیم غذایی و سبک زندگی خود را ایجاد کنید.  
   🩺 **مشاوره پزشکی** را فراموش نکنید و تغییرات اساسی را آغاز کنید!"""

bmr = """🍔 **میزان متابولیسم پایه (BMR)** شما *{}* کالری در روز است.

{}

با فیتبات، فیت بمون 💪
""" + BOT_USERNAME

class BMRRanges():
    below_average = """⚠️ **کمتر از حد نرمال**  
   🔴 میزان متابولیسم پایه شما کمتر از حد نرمال است.  
   ممکن است نیاز به بررسی وضعیت سلامتی خود داشته باشید. توصیه می‌شود که با یک متخصص تغذیه مشورت کنید و برنامه‌ای مناسب برای افزایش متابولیسم خود در نظر بگیرید.  
   🏋️‍♀️ **تمرینات ورزشی** و **رژیم غذایی متعادل** می‌تواند کمک‌کننده باشد!"""

    average = """✅ **در محدوده نرمال**  
   🟢 میزان متابولیسم پایه شما در محدوده نرمال است.  
   به نظر می‌رسد که متابولیسم شما به خوبی کار می‌کند. ادامه دهید و به رژیم غذایی و فعالیت بدنی خود توجه داشته باشید.  
   💪 **ادامه دهید** و به سلامت خود اهمیت دهید!"""

    above_average = """⚠️ **بیشتر از حد نرمال**  
   🟡 میزان متابولیسم پایه شما بیشتر از حد نرمال است.  
   این ممکن است نشانه‌ای از فعالیت‌های بدنی زیاد یا سایر عوامل باشد. توصیه می‌شود که وضعیت خود را بررسی کنید و در صورت نیاز با یک متخصص تغذیه مشورت کنید.  
   🏃‍♂️ **کنترل فعالیت‌های بدنی** و **رژیم غذایی مناسب** را در نظر بگیرید!"""

    high = """🚨 **بسیار بالا**  
   🔴 میزان متابولیسم پایه شما بسیار بالاست.  
   این ممکن است به دلایل مختلفی مانند فعالیت‌های شدید یا مشکلات متابولیکی باشد. توصیه می‌شود که با یک پزشک یا متخصص تغذیه مشورت کنید و تغییرات لازم در رژیم غذایی و سبک زندگی خود را انجام دهید.  
   🩺 **مشاوره پزشکی** را فراموش نکنید و تغییرات اساسی را آغاز کنید!"""

processing_plan = "⏳ در حال طراحی برنامه ... ⏳"

ask_description_plan = """ℹ️ لطفا درباره ویژگی‌های فیزیکی خود و برنامه ورزشی مد نظرت در یک پیام توضیح بده.

📈 دقت کن که هوش مصنوعی با توضیحات کم هم کار میکنه، اما با دادن هر اطلاعات بیشتر و دقیق‌تر درباره ویژگی‌های فیزیکیت با برنامه مد نظرت،‌ دقت برنامه طراحی شده بالاتر خواهد بود.

🔒 اطلاعاتت از طرف ما ذخیره نخواهد شد.

📝دقت کن که از این به بعد، هر پیامت به عنوان پاسخی به این پیام محسوب میشه. اگر می‌خواهی از این حالت خارج بشی، یک پیام دلخواه بفرست و از قابلیت‌های دیگر بات استفاده کن."""

complete_plan = """✅ طراحی برنامه شما توسط هوش مصنوعی کامل شد.

🤖 این برنامه تمرینی توسط هوش مصنوعی و بر اساس اطلاعاتی که شما در دسترس ما گذاشتید طراحی شده و فیتبات مسئولیتی در برابر آن قبول نمی‌کند."""

guide = """📖 راهنما

🍔 محاسبه شاخص توده بدن یا BMI
❤️‍🔥 محاسبه متابولیسم یا BMR
🏋️ دریافت برنامه تمرینی از هوش مصنوعی

⚠️  همیشه میتونی در مِنوی بات به این قابلیت ها دسترسی داشته باشی! ممکنه این منو برات بسته باشه، میتونی اون رو از بقل کیبوردت باز کنی!"""

information = """🧬 توضیح قابلیت‌ها

🍔 *محاسبه شاخص توده بدن یا BMI*: شاخص توده بدنی (BMI) یک معیار استاندارد برای ارزیابی وضعیت وزنی شما است. این شاخص به شما نشان می‌دهد که آیا وزن شما در محدوده نرمال قرار دارد، یا اینکه دچار کمبود وزن، اضافه وزن یا چاقی هستید.

❤️‍🔥 *محاسبه متابولیسم یا BMR*: میزان متابولیسم پایه (BMR) مقدار انرژی یا کالری است که بدن شما در حالت استراحت برای انجام عملکردهای پایه مانند تنفس و حفظ دمای بدن مصرف می‌کند. دانستن BMR به شما کمک می‌کند تا نیازهای کالری روزانه خود را بهتر درک کنید.

🏋️ *دریافت برنامه تمرینی از هوش مصنوعی*: با این قابلیت تنها در عرض چند ثانیه، برنامه ورزشی خصوصی سازی شده‌ای از هوش مصنوعی دریافت کنید."""

contact_us = f"""💬 برای پشتیبانی با آیدی {SUPPORT_USERNAME} در {PLATFORM_FARSI} در تماس باشید.

📧 همچنین می‌توانید به آدرس {SUPPORT_EMAIL} ایمیل بزنید."""

class MenuStrings():
    bmi = "🍔 محاسبه شاخص توده بدن یا BMI"
    bmr = "❤️‍🔥 محاسبه متابولیسم یا BMR"
    plan = "🏋️ طراحی برنامه تمرینی"
    update = "🔄 آپدیت اطلاعات"
    guide = "📖 راهنما"
    information = "🧬 توضیح قابلیت‌ها"
    contact_us = "☎️ ارتباط با ما"